In [1]:
import sqlite3 as sql
import pandas as pd

In [6]:
conn = sql.connect('bikes.db')
cursor = conn.cursor()

cursor.execute("Drop table if exists bikes")

In [60]:
usageFile = "https://data.smartdublin.ie/dataset/33ec9fe2-4957-4e9a-ab55-c5e917c7a9ab/resource/2dec86ed-76ed-47a3-ae28-646db5c5b965/download/dublin.csv"
headers = ['STATION_ID', 'TIME', 'LAST_UPDATED', 'NAME', 'BIKE_STANDS', 'AVAILABLE_BIKE_STANDS', 
           'AVAILABLE_BIKES', 'STATUS', 'ADDRESS', 'LATITUDE', 'LONGITUDE']
dfusage = pd.read_csv(usageFile, index_col=None, names = headers, skiprows=1, nrows=10000)

dfusage.head()

,STATION_ID,TIME,LAST_UPDATED,NAME,BIKE_STANDS,AVAILABLE_BIKE_STANDS,AVAILABLE_BIKES,STATUS,ADDRESS,LATITUDE,LONGITUDE
0,42,SMITHFIELD NORTH,Smithfield North,53.349562,-6.278198,NaN,NaN,NaN,NaN,NaN,NaN
1,30,PARNELL SQUARE NORTH,Parnell Square North,53.353462,-6.265305,NaN,NaN,NaN,NaN,NaN,NaN
2,54,CLONMEL STREET,Clonmel Street,53.336021,-6.262980,NaN,NaN,NaN,NaN,NaN,NaN
3,108,AVONDALE ROAD,Avondale Road,53.359405,-6.276142,NaN,NaN,NaN,NaN,NaN,NaN
4,56,MOUNT STREET LOWER,Mount Street Lower,53.337960,-6.241530,NaN,NaN,NaN,NaN,NaN,NaN

In [59]:
dfusage.to_sql('bike', conn)

ValueError: Table 'bike' already exists.

In [ ]:
pd.read_sql_query("SELECT * FROM bike LIMIT 5", conn)

,index,STATION_ID,TIME,LAST_UPDATED,NAME,BIKE_STANDS,AVAILABLE_BIKE_STANDS,AVAILABLE_BIKES,STATUS,ADDRESS,LATITUDE,LONGITUDE
0,0,42,SMITHFIELD NORTH,Smithfield North,53.349562,-6.278198,None,None,None,None,None,None
1,1,30,PARNELL SQUARE NORTH,Parnell Square North,53.353462,-6.265305,None,None,None,None,None,None
2,2,54,CLONMEL STREET,Clonmel Street,53.336021,-6.262980,None,None,None,None,None,None
3,3,108,AVONDALE ROAD,Avondale Road,53.359405,-6.276142,None,None,None,None,None,None
4,4,56,MOUNT STREET LOWER,Mount Street Lower,53.337960,-6.241530,None,None,None,None,None,None

In [ ]:
pd.read_sql_query("SELECT * FROM bike WHERE LOWER(time) LIKE 'PA%' ORDER BY time", conn)

,index,STATION_ID,TIME,LAST_UPDATED,NAME,BIKE_STANDS,AVAILABLE_BIKE_STANDS,AVAILABLE_BIKES,STATUS,ADDRESS,LATITUDE,LONGITUDE
0,86,86,PARKGATE STREET,Parkgate Street,53.347972,-6.291804,None,None,None,None,None,None
1,1,30,PARNELL SQUARE NORTH,Parnell Square North,53.353462,-6.265305,None,None,None,None,None,None
2,13,31,PARNELL STREET,Parnell Street,53.350929,-6.265125,None,None,None,None,None,None

In [ ]:
pd.read_sql_query("select * from bike where lower(TIME) like 'PA%' order by TIME", conn)

,index,STATION_ID,TIME,LAST_UPDATED,NAME,BIKE_STANDS,AVAILABLE_BIKE_STANDS,AVAILABLE_BIKES,STATUS,ADDRESS,LATITUDE,LONGITUDE
0,86,86,PARKGATE STREET,Parkgate Street,53.347972,-6.291804,None,None,None,None,None,None
1,1,30,PARNELL SQUARE NORTH,Parnell Square North,53.353462,-6.265305,None,None,None,None,None,None
2,13,31,PARNELL STREET,Parnell Street,53.350929,-6.265125,None,None,None,None,None,None